def get_block1_data():
    return [
        # Ряд E
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд E > ЯРВ8(D) > ШО-E47',
            'shops': ['42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд E > ЯРВ8(D) > ШО-E58',
            'shops': ['55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд E > ЯРВ8(D) > ШО-E75',
            'shops': ['69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд E > ЯРВ7(D) > ШО-E6',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд E > ЯРВ7(D) > ШО-E22',
            'shops': ['15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд E > ЯРВ7(D) > ШО-E35',
            'shops': ['28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41']
        },
        # Ряд H
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд H > ЯРВ8(E) > ШО-E75',
            'shops': ['16', '17', '18']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд H > ЯРВ8(E) > ШО-E58',
            'shops': ['25']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд H > ЯРВ8(E) > ШО-F102',
            'shops': ['19', '20']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд H > ЯРВ8(E) > ШО-F89',
            'shops': ['21', '22', '23', '24']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд H > ЯРВ7(D) > ШО-E6',
            'shops': ['13', '14', '15']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд H > ЯРВ7(D) > ШО-E22',
            'shops': ['26', '27']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд H > ЯРВ5(B) > ШО-B102',
            'shops': ['1', '2']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд H > ЯРВ5(B) > ШО-B89',
            'shops': ['38', '39', '40']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд H > ЯРВ6(C) > ШО-B79',
            'shops': ['6', '7']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд H > ЯРВ6(C) > ШО-B65',
            'shops': ['33', '34', '35']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд H > ЯРВ7(D) > ШО-D77',
            'shops': ['11', '12']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд H > ЯРВ7(D) > ШО-D62',
            'shops': ['28', '29', '30']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд H > ЯРВ6(C) > ШО-B79',
            'shops': ['6', '7']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд H > ЯРВ6(C) > ШО-B65',
            'shops': ['33', '34', '35']
        },
        # Ряд K
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд K > ЯРВ8(E) > ШО-E58',
            'shops': ['22', '23', '24', '25']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд K > ЯРВ8(E) > ШО-E47',
            'shops': ['16', '17', '18']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд K > ЯРВ7(D) > ШО-F89',
            'shops': ['21', '22']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд K > ЯРВ7(D) > ШО-E35',
            'shops': ['14', '15']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд K > ЯРВ5(B) > ШО-B89',
            'shops': ['39', '40']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд K > ЯРВ5(B) > ШО-B76',
            'shops': ['1', '2', '3']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд K > ЯРВ6(C) > ШО-C65',
            'shops': ['34', '35']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд K > ЯРВ6(C) > ШО-C52',
            'shops': ['6', '7', '8']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд K > ЯРВ7(D) > ШО-D62',
            'shops': ['29', '30']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд K > ЯРВ7(D) > ШО-',
            'shops': ['11', '12', '13']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд K > ЯРВ6(C) > ШО-D47',
            'shops': ['34', '35']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд K > ЯРВ6(C) > ШО-B52',
            'shops': ['6', '7', '8']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд K > ЯРВ7(D) > ШО-E22',
            'shops': ['26', '27', '28']
        },
        # Ряд M
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд M > ЯРВ8(E) > ШО-F47',
            'shops': ['37', '38', '39']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд M > ЯРВ8(E) > ШО-F74',
            'shops': ['35', '36']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд M > ЯРВ7(D) > ШО-E35',
            'shops': ['40', '41', '42']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд M > ЯРВ5(B) > ШО-B76',
            'shops': ['53', '54']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд M > ЯРВ6(C) > ШО-C52',
            'shops': ['48', '49']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд M > ЯРВ7(D) > ШО-D47',
            'shops': ['43', '44']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд M > ЯРВ6(C) > ШО-C52',
            'shops': ['48', '49']
        },
        
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд M > ЯРВ9(B65) > ШО-M8',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14', '15', '16', '17']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд M > ЯРВ9(B65) > ШО-M24',
            'shops': ['18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '34']
        },
        # Ряд F(E)
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд F > ЯРВ8(E) > ШО-F74',
            'shops': ['68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд F > ЯРВ8(E) > ШО-F89',
            'shops': ['81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд F > ЯРВ8(E) > ШО-F102',
            'shops': ['94', '95', '96', '97', '98', '99', '100', '101', '102', '103', '104', '105', '106', '107', '108', '109']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд F > ЯРВ2(F) > ШО-F34',
            'shops': ['23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд F > ЯРВ2(F) > ШО-F12',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд F > ЯРВ2(F) > ШО-F56',
            'shops': ['43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67']
        },
       
        # Ряд B
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд B > ЯРВ4(B) > ШО-B12',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд B > ЯРВ4(B) > ШО-B33',
            'shops': ['23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд B > ЯРВ4(B) > ШО-B53',
            'shops': ['43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ2 > ЩР4 > 1-блок > Ряд B > ЯРВ9(B65) > ШО-B65',
            'shops': [ '65a','65b']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд B > ЯРВ5(B) > ШО-B89',
            'shops': ['82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93', '94']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд B > ЯРВ5(B) > ШО-B102',
            'shops': ['95', '96', '97', '98', '99', '100', '101', '102', '103', '104', '105', '106', '107', '108']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд B > ЯРВ5(B) > ШО-B76',
            'shops': ['66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81']
        },
        # Ряд A
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд A > ЯРВ5(B) > ШО-B102',
            'shops': ['44', '45', '46']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд A > ЯРВ6(C) > ШО-C79',
            'shops': ['39', '40', '41']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд A > ЯРВ7(D) > ШО-D77',
            'shops': ['34', '35', '36']
        },
         {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд B > ЯРВ7(B) > ШО-C8',
            'shops': ['42', '43']
        },
         {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд C > ЯРВ7(C) > ШО-DD8',
            'shops': ['37', '38']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд A > ЯРВ7(D) > ШО-E6',
            'shops': ['32', '33']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд A > ЯРВ1(A) > ШО-A8',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14', '15']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР1 > 1-блок > Ряд A > ЯРВ1(A) > ШО-A24',
            'shops': ['16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31']
        },
       
        # Ряд C
          {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд C > ЯРВ5(B) > ШО-C8',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14']
        },

         {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд C > ЯРВ5(B) > ШО-C21',
            'shops': ['15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27']
        },

         {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд C > ЯРВ5(B) > ШО-C36',
            'shops': ['28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42','43']
        },
       
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд C > ЯРВ6(C) > ШО-C51',
            'shops': ['44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58']
        },

        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд C > ЯРВ6(C) > ШО-C65',
            'shops': ['59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71']
        },
      
        {
            'path': 'ТП-6699 > Т1 > ВРУ1 > ЩР5 > 1-блок > Ряд C > ЯРВ6(C) > ШО-C79',
            'shops': ['72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85']
        },
        
        
        
        # Ряд D
        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд D > ЯРВ7(D) > ШО-D8',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '12', '13', '14']
        },

        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд D > ЯРВ7(D) > ШО-D22',
            'shops': ['15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27']
        },

        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд D > ЯРВ7(D) > ШО-D35',
            'shops': ['28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42']
        },

        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд D > ЯРВ7(D) > ШО-18',
            'shops': ['43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56']
        },

        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд D > ЯРВ7(D) > ШО-16',
            'shops': ['57', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69']
        },

        {
            'path': 'ТП-6699 > Т1 > ВРУ4 > ЩР2 > 1-блок > Ряд D > ЯРВ7(D) > ШО-14',
            'shops': ['70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83']
        },

        # Ряд L
        {
            'path': 'ТП-6699 > Т1 > ВРУ7 > ЯРВ3(П) > 1-блок > Ряд L > ШО-L9',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > шит-L15 > 1-блок > Ряд L > Маг-L15 1-линия',
            'shops': ['Маг-L15 1-линия']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > шит-L14 > 1-блок > Ряд L > Маг-14',
            'shops': ['Маг-14']
        },
        {
            'path': 'ТП-4768 > Т1/Т2 > АВР(ЩР18)/АВР(ЩР19) > шит-L18 > 1-блок > Ряд L > Маг-18 (Q-4,5,6)',
            'shops': ['Маг-18 (Q-4,5,6)']
        },
        # Ряд Q
        {
            'path': 'ТП-6699 > Т1 > ВРУ7 > ЯРВ3(П) > 1-блок > Ряд Q > ШО-35(П)',
            'shops': ['1-блок туалет + тахоратхона', '005', '1', '3']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ7 > ЯРВ3(П) > 1-блок > Ряд Q > ШО-35(П) > ШО-36',
            'shops': ['11', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ7 > ЯРВ3(П) > 1-блок > Ряд Q > ШО-35(П) > ШО-36 > ШО-Q30',
            'shops': ['31', '32', '34', '35']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ7 > ЯРВ3(Л) > 1-блок > Ряд Q > ШО-35(Л) > ШО-Q39',
            'shops': ['39', '40', '41', '99', '100']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > V Ряд > 1-блок > Ряд Q > Маг-33',
            'shops': ['Маг-33']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > шит-Q17 > 1-блок > Ряд Q > Маг-17 (1-линия)',
            'shops': ['Маг-17 (1-линия)']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > шит-Q17(подвал) > 1-блок > Ряд Q > Маг-17 подвал(1-линия)',
            'shops': ['Маг-17 подвал(1-линия)']
        },
        {
            'path': 'ТП-4768 > Т1/Т2 > АВР(ЩР18)/АВР(ЩР19) > шит-L18 > 1-блок > Ряд Q > Маг-4,5,6 (L-18)',
            'shops': ['Маг-4,5,6 (L-18)']
        },
        # Ряд R
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР4) > 1-блок > Ряд R > ШО-R1',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', 'освещение ряда Q и V']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > 1-блок > Ряд R > ШО-R2',
            'shops': ['26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > 1-блок > Ряд R > ШО-R3',
            'shops': ['25', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71']
        },
        # Ряд V
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > 1-блок > Ряд V',
            'shops': ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16']
        },
        # Прочие объекты
        {
            'path': 'ТП-тинаник > Т1 > АВР > ЩР > 1-блок > Ряд O > ШР-сомсохона > ШО-1-ошхона > 1-ошхона(1-линия)',
            'shops': ['1-ошхона(1-линия)']
        },
        {
            'path': 'ТП-6699 > Т2 > ВРУ3 > ЩР3 > 1-блок > Ряд O > ШО-1-ошхона > 1-ошхона(2-линия)',
            'shops': ['1-ошхона(2-линия)']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > Офис',
            'shops': ['Офис']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > ШО-1-блок > 1-блок освищение',
            'shops': ['1-блок освищение']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > ШО-режим > Режим хонаси',
            'shops': ['Режим хонаси']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > ШО-7-пост > ШО-2-блок освищенияси > 2-блок освищение',
            'shops': ['2-блок освищение']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд F > Блогер хонаси',
            'shops': ['Блогер хонаси']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд M > 3-пост',
            'shops': ['3-пост']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд F > 4-пост',
            'shops': ['4-пост']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд F > 4a-пост контейнерлар',
            'shops': ['4a-пост контейнерлар']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд A > пожарний сигнализасия',
            'shops': ['пожарний сигнализасия']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > шит-L15 > Ряд V > АСКУЭ хонаси',
            'shops': ['АСКУЭ хонаси']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > Ряд V > ШО-Реклама > Реклама и Фарошлархонаси',
            'shops': ['Реклама и Фарошлархонаси']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > Ряд V > ШО-Реклама > 6а-пос',
            'shops': ['6а-пос']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > Ряд V > АСКУЭ V-катор сигнал сим',
            'shops': ['АСКУЭ V-катор сигнал сим']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > 1-блок > Ряд L > Печенье цех-3-пост',
            'shops': ['Печенье цех-3-пост']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > 1-блок > Ряд R > ШО-R3',
            'shops': ['освещение ряда Q и V']
        },
    ]