SPECIFIC_OBJECTS = {
    "1-блок": [
        {
            'path': 'ТП-тинаник > Т1 > АВР > ЩР > 1-блок > Ряд O > ШР-сомсохона > ШО-1-ошхона > 1-ошхона(1-линия)',
            'shops': ['1-ошхона(1-линия)']
        },
        {
            'path': 'ТП-6699 > Т2 > ВРУ3 > ЩР3 > 1-блок > Ряд O > ШО-1-ошхона > 1-ошхона(2-линия)',
            'shops': ['1-ошхона(2-линия)']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > Офис',
            'shops': ['Офис']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > ШО-1-блок > 1-блок освищение',
            'shops': ['1-блок освищение']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > ШО-режим > Режим хонаси',
            'shops': ['Режим хонаси']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Ряд Офис > Офис-дизель шит (1-линия) > ШО-7-пост > ШО-освищение 2-блока > 2-блок освищение',
            'shops': ['2-блок освищение']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд F > Блогер хонаси',
            'shops': ['Блогер хонаси']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд M > 3-пост',
            'shops': ['3-пост']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд F > 4-пост',
            'shops': ['4-пост']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд F > 4a-пост контейнерлар',
<<<<<<< HEAD
            'shops': ['4a-пост контейнерлар','4b-пост контейнерлар']
=======
            'shops': ['4a-пост контейнерлар']
>>>>>>> 0a443b78e1205ad500a69cac15de4ce84c48af83
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ5 > ЩР6 > 1-блок > Ряд A > пожарний сигнализасия',
            'shops': ['пожарний сигнализасия']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > шит-L15 > Ряд V > АСКУЭ хонаси',
            'shops': ['АСКУЭ хонаси']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > Ряд V > ШО-Реклама > Реклама и Фарошлархонаси',
            'shops': ['Реклама и Фарошлархонаси']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > Ряд V > ШО-Реклама > 6а-пос',
            'shops': ['6а-пос']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > Ряд V > АСКУЭ V-катор сигнал сим',
            'shops': ['АСКУЭ V-катор сигнал сим']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР18) > ЩР-Vip > 1-блок > Ряд L > Печенье цех-3-пост',
            'shops': ['Печенье цех-3-пост']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР5) > 1-блок > Ряд R > ШО-R3',
            'shops': ['освещение ряда Q и V']
        }
    ],

    "2-блок": [
        {
            'path': 'ТП-6699 > Т1 > 2-блок шитовой > Шит-2 > 2-блок > Ряд S > ШО-2 > ШО-4',
            'shops': ['1-пост(5-арка)']
        },
        {
            'path': 'ТП-6699 > Т1 > ВРУ3 > ЩР3 > 1-блок > Офис-дизель шит (1-линия) > ШО-7-пост > 2-блок > Ряд S > ШО-2',
            'shops': ['1-пост(5-арка-дизель линия:шлакбаун)']
        },
        {
            'path': 'ТП-6699 > Т1 > 2-блок шитовой > Шит-2 > 2-блок > Ряд U',
            'shops': ['9-пост Гамбургер бутка', '9-пост охрана']
        },
        {
            'path': 'ТП-6699 > Т1 > 2-блок шитовой > Шит-6 > 2-блок > Ряд U',
            'shops': ['35-пост Гамбургер бутка', '35-пост охрана']
        }
    ],

    "3-блок": [
        {
            'path': 'ТП-4768 > Т2 > АВР(ЩР8) > 3-блок > Ряд 1 > ЩР8 > ШО-сантех',
            'shops': ['3-блок туалет,сантехникхона,катёл']
        },
        {
            'path': 'ТП-4768 > Т2 > АВР(ЩР10) > 3-блок > Ряд 1 > ЩР-10',
            'shops': ['3-блок туалет,сантехникхона катёл']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР6) > 3-блок > ШО-ZARIN',
            'shops': ['Маг-ZARIN']
        },
        {
            'path': 'ТП-4768 > Т1/Т2 > АВР(ЩР11)/АВР(ЩР8) > 3-блок > ЩР11/ЩР8 > Ряд 1 > ШО-Нодир шит',
            'shops': ['Тунель калитка шит на столбе']
        },
        {
            'path': 'ТП-4768 > Т2 > АВР(ЩР7) > 3-блок > Ряд 1 > ШО-29',
            'shops': ['13-пост', 'Пирошкихона1', 'Пирошкихона2']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР11) > 3-блок > ЩР11 > Ряд 2 > 12 пост',
            'shops': ['Печенье цех-12-пост']
        },
        {
            'path': 'ТП-4768 > Т1 > АВР(ЩР11) > 3-блок > ЩР11 > Ряд 3 > ШО-20',
            'shops': ['освещение 3-блока:(магазин 3-57)']
        },
        {
            'path': 'ТП-4768 > Т2 > АВР(ЩР17) > 3-блок > ЩР17 > Ряд 11 > ШО-освещение 11-ряда',
            'shops': ['ШО-освещение 11-ряда']
        },
        {
            'path': 'ТП-4768 > Т2 > АВР(ЩР17) > 3-блок > ЩР17 > Ряд 11 > Кабинет электриков',
            'shops': ['Кабинет электриков']
        },
        {
            'path': 'ТП-5353 > Т2 > АВР(ЩР16) > 3-блок > ЩР16 > Ряд 5 > ШО-28',
            'shops': ['13-пост', 'Paynet']
<<<<<<< HEAD
        },
         {
            'path': 'ТП-4768 > Т1/Т2 > АВР(ЩР11)/АВР(ЩР8) > 3-блок > ЩР11/ЩР8 > Ряд 1 > ЩР-Нодир шит > ШО-тунель калитка шит',
            'shops': ['Тунель калитка шит на столбе', 'Тунель калитка Пирошкихона', 'Остановка кафе-1']
        },
=======
        }
>>>>>>> 0a443b78e1205ad500a69cac15de4ce84c48af83
    ],
    "Гипермаркет": [

    
          {
            'path':'ТП-5353 > Т1 > АВР(Эвос) > ШО-Эвос-счетчик > ШО-Эвос',
            'shops': ['Эвос']
        },
        {
<<<<<<< HEAD
            'path':'ТП-5353 > Т2 > АВР(14A) > ШО-14A',
=======
            'path':'ТП-5353 > Т2 > АВР(14A) > Подвал > ШО-14A',
>>>>>>> 0a443b78e1205ad500a69cac15de4ce84c48af83
            'shops': ['пост 14A', 'Гамбургер бутка 14A']
        },
        {
            'path':'ТП-5353 > Т1 > АВР(Чилер осв-е, разетка) > ШО-Чилер',
            'shops': ['Чилер бутка']
        },
        {
            'path':'ТП-5353 > Т1 > Автомат(Шарк) > ВЗУ-Шарк/Фаиз > ШО-Шарк1',
            'shops': ['Шарк 1,2,3,4,5,6,7,8,9']
        },
        {
            'path':'ТП-5353 > Т1 > Автомат(Шарк) > ВЗУ-Шарк/Фаиз > ШО-Шарк2',
            'shops': ['Шарк склад']
        },
        {
            'path':'ТП-5353 > Т2 > Автомат(Файз) > ВЗУ-Шарк/Фаиз > ШО-Фаиз',
            'shops': ['Фаиз кафе']
        },
         {
            'path':'ТП-5353 > Т2 > Автомат(Тунель) > Тунель Фарошлархонаси > ШО-Тунель',
            'shops': ['Тунель']
        },
         {
            'path':'ТП-5353 > Т1 > Шит-Al-Sahiy счетчик > ШО-Al-Sahiy',
            'shops': ['Al-Sahiy кафе']
        },
        {
            'path':'ТП-5353 > Т2 > Шит-Risq счетчик > ШО-Risq',
            'shops': ['Risq кафе']
        },
        {
            'path':'ТП-5353 > Т2 > Шит-Капалак счетчик > ШО-Капалак',
            'shops': ['Капалак кафе']
        },
         {
            'path':'ТП-5353 > Т1 > Шит-Остановка счетчик > ШО-Остановка-2',
            'shops': ['Остановка кафе-2']
<<<<<<< HEAD
        },
        {
            'path':'ТП-5353 > Т2 > Шит-M-39(2)счетчик > ШО-Стоянка M-39(2)',
            'shops': ['Стоянка M-39(2)']
        },
         {
           'path': 'ТП-7694 > Т1 > АРВ-сомсахона > ЩР-сомсахона',
            'shops': ['Сомсахона-1', 'Сомсахона-2', 'Сомсахона-3', 'Гош дукон', 'Милиция']
        },
        {  'path': 'ТП-7694 > Т2 > Дизель шит > Резервуар(автомат) > 1-блок > Ряд R > ШО-R2 > Резервуар шит',
           'shops': ['Резервуар насос']     
        },
        {  'path': 'ТП-7694 > Т2 > Дизель шит > Резервуар(автомат) > 1-блок > Ряд R > ШО-R2 > тускатель',
           'shops': ['Чирчик стоянка осв-е']     
=======
>>>>>>> 0a443b78e1205ad500a69cac15de4ce84c48af83
        }
        
        

    ]
<<<<<<< HEAD
}

=======
}
>>>>>>> 0a443b78e1205ad500a69cac15de4ce84c48af83
