Repository: AbdimuratovBahrom/store-path-finder
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: uz_cyrl, uz_latn

source: Store Path Finder
uz_cyrl: Дўконга йўл топиш
uz_latn: Do‘konga yo‘l topish

source: Language
uz_cyrl: Тил
uz_latn: Til

source: Русский
uz_cyrl: Русча
uz_latn: Ruscha

source: Узбекский (Кириллица)
uz_cyrl: Ўзбекча (Кириллица)
uz_latn: O‘zbekcha (Kirillitsa)

source: O'zbek (Lotin)
uz_cyrl: O‘zbekcha (Lotin)
uz_latn: O‘zbekcha (Lotin)

source: Поиск линий электроснабжения магазинов
uz_cyrl: Дўконлар электр таъминоти линияларини қидириш
uz_latn: Do‘konlar elektr ta'minoti liniyalarini qidirish

source: Выберите блок
uz_cyrl: Блокни танланг
uz_latn: Blokni tanlang

source: Выберите ряд
uz_cyrl: Қаторни танланг
uz_latn: Qatorni tanlang

source: Выберите магазин
uz_cyrl: Дўконни танланг
uz_latn: Do‘konni tanlang

source: Поиск
uz_cyrl: Қидириш
uz_latn: Qidirish

source: Ошибка загрузки рядов
uz_cyrl: Қаторларни юклаш хатоси
uz_latn: Qatorlarni yuklash xatosi

source: Ошибка загрузки магазинов
uz_cyrl: Дўконларни юклаш хатоси
uz_latn: Do‘konlarni yuklash xatosi

source: Ошибка загрузки пути
uz_cyrl: Йўлни юклаш хатоси
uz_latn: Yo‘lni yuklash xatosi

source: Блоки 1,2,3
uz_cyrl: Блоклар 1,2,3
